In [10]:
import pandas as pd
import numpy as np
import os
import env
import matplotlib.pyplot as plt
import seaborn as sns

# no yelling in the library
import warnings
warnings.filterwarnings("ignore")

from math import sqrt
import scipy.stats as stats

#import explore
#import acquire

1. Which lesson appears to attract the most traffic consistently across cohorts (per program)?
****

2. Is there a cohort that referred to a lesson significantly more than other cohorts seemed to gloss over?
****

3. Are there students who, when active, hardly access the curriculum? If so, what information do you have about these students?
****

4. Is there any suspicious activity, such as users/machines/etc accessing the curriculum who shouldnâ€™t be? Does it appear that any web-scraping is happening? Are there any suspicious IP addresses?
****

5. At some point in 2019, the ability for students and alumni to access both curriculums (web dev to ds, ds to web dev) should have been shut off. Do you see any evidence of that happening? Did it happen before?
****

6. What topics are grads continuing to reference after graduation and into their jobs (for each program)?
****

7. Which lessons are least accessed?
****

8. Anything else I should be aware of?
****

In [2]:
#to be placed into acquire.py module
import pandas as pd
import numpy as np
import os


def new_data():
    '''
    This function takes in a csv file
    then returns a merged pandas dataframe with that data
    '''
    df = pd.read_csv('cohorts.csv')
        
    return df

In [58]:
cohort = new_data()

In [59]:
cohort.head()

   cohort_id        name  start_date    end_date  program_id
0          1      Arches  2014-02-04  2014-04-22           1
1          2    Badlands  2014-06-04  2014-08-22           1
2          3    Carlsbad  2014-09-04  2014-11-05           1
3          4      Denali  2014-10-20  2015-01-18           1
4          5  Everglades  2014-11-18  2015-02-24           1

In [60]:
cohort.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   cohort_id   46 non-null     int64
 1   name        46 non-null     object
 2   start_date  46 non-null     object
 3   end_date    46 non-null     object
 4   program_id  46 non-null     int64
dtypes: int64(2), object(3)
memory usage: 1.9+ KB

In [11]:
def new_sql_data():
    url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/curriculum_logs'
    df1 = pd.read_sql('SELECT * FROM logs', url)
    return df1

In [12]:
df1 = new_sql_data()

In [13]:
df1.head()

,date,time,path,user_id,cohort_id,ip
0,2018-01-26,09:55:03,/,1,8.0,97.105.19.61
1,2018-01-26,09:56:02,java-ii,1,8.0,97.105.19.61
2,2018-01-26,09:56:05,java-ii/object-oriented-programming,1,8.0,97.105.19.61
3,2018-01-26,09:56:06,slides/object_oriented_programming,1,8.0,97.105.19.61
4,2018-01-26,09:56:24,javascript-i/conditionals,2,22.0,97.105.19.61

In [51]:
print (df1.cohort_id.min())
print (df1.cohort_id.max())

1.0
139.0

In [16]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 900223 entries, 0 to 900222
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   date       900223 non-null  object
 1   time       900223 non-null  object
 2   path       900222 non-null  object
 3   user_id    900223 non-null  int64
 4   cohort_id  847330 non-null  float64
 5   ip         900223 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 41.2+ MB

In [26]:
#df1['cohort_id'].astype(int)
df1['cohort_id'].isnull().value_counts()

False    False
True     False
Name: cohort_id, dtype: bool

In [31]:
no_cohort = df1[(df1['cohort_id'].isnull() == True)]

In [32]:
no_cohort.head()

,date,time,path,user_id,cohort_id,ip
411,2018-01-26,16:46:16,/,48,NaN,97.105.19.61
412,2018-01-26,16:46:24,spring/extra-features/form-validation,48,NaN,97.105.19.61
425,2018-01-26,17:54:24,/,48,NaN,97.105.19.61
435,2018-01-26,18:32:03,/,48,NaN,97.105.19.61
436,2018-01-26,18:32:17,mysql/relationships/joins,48,NaN,97.105.19.61

In [36]:
no_cohort.user_id.value_counts().head(20)

354    2965
736    2358
363    2248
716    2136
368    2085
723    1692
349    1663
720    1646
48     1581
727    1573
362    1561
346    1513
355    1436
721    1433
719    1420
353    1398
714    1336
717    1317
715    1159
367    1141
Name: user_id, dtype: int64

In [34]:
no_cohort.path.value_counts()

/                                          4459
search/search_index.json                   1985
javascript-i                                780
toc                                         706
spring                                      641
                                           ...
content/php_ii/array-functions                1
content/git/branching.html                    1
stats/more-statistical-testing-examples       1
12-advanced-topics/3.8-json-responses         1
8.8_Project                                   1
Name: path, Length: 1112, dtype: int64

In [48]:
(no_cohort.ip.value_counts() == 1).value_counts()

False    339
True      74
Name: ip, dtype: int64

In [44]:
print (df1.user_id.value_counts().head(20).sort_index(ascending= True))
print (no_cohort.user_id.value_counts().head(20).sort_index(ascending= True))

1       7404
11     17913
53     12329
64     16347
211     4227
248     5075
314     7783
315     4510
344     5460
423     3804
428     5897
485     3268
495     6451
524     3512
545     3528
555     3687
570     4584
581     6434
671     3241
685     3522
Name: user_id, dtype: int64
48     1581
346    1513
349    1663
353    1398
354    2965
355    1436
362    1561
363    2248
367    1141
368    2085
714    1336
715    1159
716    2136
717    1317
719    1420
720    1646
721    1433
723    1692
727    1573
736    2358
Name: user_id, dtype: int64

In [53]:
df1['cohort_id'] = df1['cohort_id'].fillna(999)

In [54]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 900223 entries, 0 to 900222
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   date       900223 non-null  object
 1   time       900223 non-null  object
 2   path       900222 non-null  object
 3   user_id    900223 non-null  int64
 4   cohort_id  900223 non-null  float64
 5   ip         900223 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 41.2+ MB

In [55]:
df1['cohort_id'] = df1['cohort_id'].astype(int)

In [56]:
df1.head()

,date,time,path,user_id,cohort_id,ip
0,2018-01-26,09:55:03,/,1,8,97.105.19.61
1,2018-01-26,09:56:02,java-ii,1,8,97.105.19.61
2,2018-01-26,09:56:05,java-ii/object-oriented-programming,1,8,97.105.19.61
3,2018-01-26,09:56:06,slides/object_oriented_programming,1,8,97.105.19.61
4,2018-01-26,09:56:24,javascript-i/conditionals,2,22,97.105.19.61

In [61]:
cohort.head()

   cohort_id        name  start_date    end_date  program_id
0          1      Arches  2014-02-04  2014-04-22           1
1          2    Badlands  2014-06-04  2014-08-22           1
2          3    Carlsbad  2014-09-04  2014-11-05           1
3          4      Denali  2014-10-20  2015-01-18           1
4          5  Everglades  2014-11-18  2015-02-24           1

In [62]:
df = pd.merge(df1, cohort, left_on='cohort_id', right_on='cohort_id', how='left')

In [63]:
df.head()

,date,time,path,user_id,cohort_id,ip,name,start_date,end_date,program_id
0,2018-01-26,09:55:03,/,1,8,97.105.19.61,Hampton,2015-09-22,2016-02-06,1.0
1,2018-01-26,09:56:02,java-ii,1,8,97.105.19.61,Hampton,2015-09-22,2016-02-06,1.0
2,2018-01-26,09:56:05,java-ii/object-oriented-programming,1,8,97.105.19.61,Hampton,2015-09-22,2016-02-06,1.0
3,2018-01-26,09:56:06,slides/object_oriented_programming,1,8,97.105.19.61,Hampton,2015-09-22,2016-02-06,1.0
4,2018-01-26,09:56:24,javascript-i/conditionals,2,22,97.105.19.61,Teddy,2018-01-08,2018-05-17,2.0